Repository: ErikAT04/TFG_Antivirus_ErikAT
Catalog: lib/l10n/app_*.arb
Languages: de, es, fr

source: Cancel
de: Stornieren
es: Cancelar
fr: Annuler

source: Log in
de: Anmelden
es: Iniciar Sesión
fr: Se connecter

source: Sign up
de: Registrieren
es: Registrarse
fr: S'inscrire

source: User or Email
de: Benutzername oder E-Mail
es: Usuario o Correo Electrónico
fr: Utilisateur ou E-mail

# pass
source: Password
de: Passwort
es: Contraseña
fr: Mot de passe

# putCredentials
source: Insert your data
de: Geben Sie Ihre Anmeldeinformationen ein
es: Introduzca sus credenciales
fr: Veuillez entrer vos identifiants

# errorEmptyField
source: You can't leave this field empty
de: Sie können das Feld nicht leer lassen
es: No puedes dejar el campo vacío
fr: Vous ne pouvez pas laisser le champ vide

# errorNotFound
source: Couldn't find any user with that username or email
de: Benutzer mit diesem Namen oder dieser E-Mail-Adresse nicht gefunden
es: No se ha encontrado ningún usuario con ese nombre o correo
fr: Aucun utilisateur trouvé avec ce nom ou cette adresse

# errorWrongPass
source: Wrong password
de: Falsches Passwort
es: Contraseña incorrecta
fr: Passe incorrect

# logInContext
source: Press here to log in
de: Klicken Sie hier, um sich anzumelden
es: Pulse aquí para iniciar sesión
fr: Cliquez ici pour vous connecter

# registerContext
source: Press here to sign up
de: Klicken Sie hier, um sich zu registrieren
es: Pulse aquí para registrarse
fr: Cliquez ici pour vous inscrire

# userOrEmailContext
source: Write your username or email here
de: Geben Sie Ihren Benutzernamen oder Ihre E-Mail-Adresse ein
es: Introduzca su nombre de usuario o correo electrónico
fr: Entrez votre nom d'utilisateur ou votre email

# passContext
source: Write your password here
de: Geben Sie Ihr Passwort ein
es: Introduzca su contraseña
fr: Entrez votre mot de passe

# uname
source: Username
de: Benutzername
es: Nombre de Usuario
fr: Nom d'utilisateur

# repPass
source: Repeat password
de: Passwort wiederholen
es: Repetir Contraseña
fr: Répetez le mot de Passe

# unameUnavaliable
source: Username unavaliable
de: Benutzername nicht verfügbar
es: Nombre de usuario no disponible
fr: Nom d'utilisateur non disponible

# passwordNotValid
source: The password does not meet the requirements
de: Passwort entspricht nicht der Anforderungen
es: La contraseña no cumple los requisitos
fr: Le mot de passe ne répond pas aux exigences

# diffPasswords
source: Passwords do not match
de: Passwörter stimmen nicht überein
es: Las contraseñas no coinciden
fr: Les mots de passe ne correspondent pas

# emailNotValid
source: The email does not meet the requirements
de: E-Mail entspricht nicht den Anforderungen
es: El correo no cumple los requisitos
fr: L'e-mail ne répond pas aux exigences

# emailUnavaliable
source: This email has already been registered
de: Diese E-Mail ist bereits registriert
es: Este correo ya está registrado
fr: Cet e-mail est déjà enregistré

# unameContext
source: Write here your username
de: Geben Sie hier Ihren Benutzernamen ein
es: Introduzca aquí su nombre de usuario
fr: Entrez votre nom d'utilisateur ici

# emailContext
source: Write here your email
de: Geben Sie hier Ihre E-Mail-Adresse ein
es: Introduzca aquí su correo electrónico
fr: Entrez votre email ici

# repPassContext
source: Repeat your password
de: Wiederholen Sie Ihr Passwort
es: Repita su contraseña
fr: Répétez votre mot de passe

# mainPageContext
source: Click here to go to the analysis menu
de: Klicken Sie hier, um zum Analysemenü zu gelangen
es: Pulse aquí para ir al menú de análisis
fr: Cliquez ici pour accéder au menu d'analyse

# vaultContext
source: Click here to go to the locked files menu
de: Klicken Sie hier, um zum Menü 'Gesperrte Dateien' zu gelangen
es: Pulse aquí para ir al menú de archivos bloqueados
fr: Cliquez ici pour accéder au menu des fichiers verrouillés

# deviceContext
source: Click here to go to the devices menu
de: Klicken Sie hier, um zum Gerätemenü zu gelangen
es: Pulse aquí para ir al menú de dispositivos
fr: Cliquez ici pour accéder au menu des appareils

source: No data yet
de: Noch keine Daten
es: No hay archivos en cuarentena
fr: Pas encore de données

source: Analyse
de: Analysieren
es: Analizar
fr: Analyser

source: Main Page
de: Hauptseite
es: Página Principal
fr: Page principale

# pleaseWait
source: Please wait for the program to finish.
de: Bitte warten Sie, bis das Programm beendet ist
es: Por favor, espere a que el análisis finalice.
fr: Veuillez attendre la fin du programme.

# mightTakeaWhile
source: It might take a while
de: Es kann eine Weile dauern
es: Puede tardar un rato
fr: Cela pourrait prendre un certain temps

# analyseBttContext
source: Press here to analyse your device
de: Klicken Sie hier, um das Gerät zu analysieren
es: Pulse aquí para analizar el dispositivo
fr: Cliquez ici pour analyser l'appareil

# vault
source: File Vault
de: Dateispeicher
es: Baúl de Archivos
fr: Coffre de fichiers

# vaultLow
source: Vault
de: Speicher
es: Baúl
fr: Coffre

# vaultDesc
source: Here you'll have sour device's files which has been put under quarantine in order to protect your data
de: Hier erscheinen die Dateien, die zur Sicherung des Geräts quarantänisiert wurden
es: Aquí aparecerán los archivos que han sido puestos en cuarentena para proteger el dispositivo
fr: Ici apparaîtront les fichiers qui ont été mis en quarantaine pour protéger l'appareil

source: File Route:
de: Dateipfad:
es: Ruta del Archivo:
fr: Chemin du fichier :

# malType
source: Malware Type:
de: Malware-Typ:
es: Tipo de Malware:
fr: Type de malware :

# confDate
source: Quarantine Date:
de: Quarantänedatum:
es: Fecha de Confinamiento:
fr: Date de confinement :

# restFile
source: Restore File
de: Datei Wiederherstellen
es: Restaurar Archivo
fr: Restaurer le fichier

source: File list
de: Dateiliste
es: Lista de archivos
fr: Liste des fichiers

# devlist
source: Device list
de: Geräteliste
es: Lista de dispositivos
fr: Liste des appareils

source: My Devices
de: Meine Geräte
es: Mis Dispositivos
fr: Mes appareils

# devicesLow
source: Devices
de: Geräte
es: Dispositivos
fr: Appareils

source: Last Analysis:
de: Letzte Analyse:
es: Último análisis:
fr: Dernière analyse :

# regDate
source: Registered in:
de: Registrierungsdatum:
es: Fecha de Registro:
fr: Date d'enregistrement :

# drawerFFolders
source: Forbidden Folders
de: Ausgeschlossene Ordner
es: Carpetas Prohibidas
fr: Dossiers exclus

# drawerTranslate
source: Translate
de: Übersetzen
es: Traducir
fr: Traduire

# drawerDarkMode
source: Dark Mode
de: Dunkelmodus
es: Modo Oscuro
fr: Mode sombre

# drawerAppVer
source: App Version
es: Versión de la Aplicación
fr: Version de l'application

# userTile
source: Profile Settings
de: Profileinstellungen
es: Ajustes del Perfil
fr: Paramètres du profil

# userContext
source: Click here to go to the user menu
de: Klicken Sie hier, um zum Benutzermenü zu gelangen
es: Pulse aquí para ir al menú de usuario
fr: Cliquez ici pour accéder au menu utilisateur

# ffoldersContext
source: Click here to go to the prohibited folders menu
de: Klicken Sie hier, um zum Menü'Verbotene Ordner' zu gelangen
es: Pulse aquí para ir al menú de carpetas prohibidas
fr: Cliquez ici pour accéder au menu des dossiers interdits

# translate
source: Click on the flag to change language
de: Klicken Sie auf die Flagge, um die Sprache zu ändern
es: Pulse en la bandera para cambiar idioma
fr: Cliquez sur le drapeau pour changer de langue

# drawerAppVerContext
source: Click here to see application version data
de: Klicken Sie hier, um Daten zur Anwendungsversion anzuzeigen
es: Pulse aquí para ver los datos de las versiones de la aplicación
fr: Cliquez ici pour voir les données de version de l'application

# darkModeContext
source: Switch between light and dark mode here
de: Wechseln Sie hier zwischen Hell- und Dunkelmodus
es: Cambie aquí el modo claro y oscuro
fr: Basculez entre les modes clair et sombre ici

source: Change Color
de: Farbe ändern
es: Cambiar Color
fr: Changer la Couleur

# changeColorContext
source: Choose the colour you like the most to use it in this app
de: Wählen Sie die Farbe aus, die Ihnen in der Anwendung am besten gefällt
es: Selecciona el color que más te guste para utilizar en la aplicación
fr: Sélectionnez la couleur que vous préférez utiliser dans l'application

# fFoldersInfo
source: The different folders in this page won't be scanned by the app
de: Hier erscheinen die Ordner, die der Antivirus nicht scannen soll
es: Aquí aparecerán las carpetas a las que no se desea que el antivirus analice
fr: Ici apparaîtront les dossiers que l'antivirus ne doit pas analyser

# fFoldersAddFolder
source: Add Folder
de: Ordner Hinzufügen
es: Añadir Carpeta
fr: Ajouter un dossier

# fFoldersFolder
source: Folders:
de: Ordner:
es: Carpeta:
fr: Dossier :

# fFoldersAlreadyError
source: Esta carpeta ya estaba en la lista
de: Dieser Ordner war bereits in der Liste
fr: Ce dossier était déjà dans la liste

# ffolderBttContext
source: Pulse aquí para añadir una nueva carpeta
de: Klicken Sie hier, um einen neuen Ordner hinzuzufügen
fr: Cliquez ici pour ajouter un nouveau dossier

# ffolderList
source: Lista de carpetas prohibidas, puedes eliminarlas dando al icono de borrar
de: Liste der verbotenen Ordner. Sie können sie löschen, indem Sie auf das Löschsymbol klicken
fr: Liste des dossiers interdits, vous pouvez les supprimer en cliquant sur l'icône Supprimer

source: User
de: Benutzer
es: Usuario
fr: Utilisateur

# userMemSince
source: Member since:
de: Mitglied seit:
es: Miembro desde:
fr: Membre depuis :

# userNumDevices
source: Total connected devices:
de: Verbundenen Geräte:
es: Dispositivos conectados:
fr: Appareils connectés :

# userTotalScans
source: Total scans:
de: Gesamtanzahl der Scans:
es: Total de escaneos:
fr: Total des analyses :

# userCName
source: Change Name
de: Namen Ändern
es: Cambiar Nombre
fr: Changer de nom

# userCPass
source: Change Password
de: Passwort Ändern
es: Cambiar Contraseña
fr: Changer de mot de passe

# userLOut
source: Log out
de: Abmelden
es: Cerrar Sesión
fr: Se déconnecter

# userErase
source: Erase Account
de: Konto Löschen
es: Borrar Cuenta
fr: Supprimer le compte

# userAskErase
source: Are you sure you want to delete your account? This action cannot be undone
de: Sind Sie sicher, dass Sie Ihr Konto löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden
es: ¿Estás seguro de que quieres borrar tu cuenta? Esta acción no se puede deshacer
fr: Êtes-vous sûr de vouloir supprimer votre compte? Cette action ne peut pas être annulée

# userImg
source: User Image
de: Benutzerbild
es: Imagen del usuario
fr: Image de l'utilisateur

# userImgContext
source: Click on it to change the image
de: Klicken Sie darauf, um das Bild zu ändern
es: Pulse sobre ella para cambiar la imagen
fr: Cliquez dessus pour changer l'image

# userCNameContext
source: Click here to change your username
de: Klicken Sie hier, um Ihren Benutzernamen zu ändern
es: Pulse aquí para cambiar su nombre de usuario
fr: Cliquez ici pour changer votre nom d'utilisateur

# userCPassContext
source: Click here to change your password
de: Klicken Sie hier, um Ihr Passwort zu ändern
es: Pulse aquí para cambiar su contraseña
fr: Cliquez ici pour changer votre mot de passe

# userLOutContext
source: Click here to log out
de: Klicken Sie hier, um sich abzumelden
es: Pulse aquí para cerrar su sesión
fr: Cliquez ici pour vous déconnecter

# userEraseContext
source: Click here to delete your account
de: Klicken Sie hier, um Ihr Konto zu löschen
es: Pulse aquí para borrar su cuenta
fr: Cliquez ici pour supprimer votre compte

# confirmContext
source: Press to confirm your action
de: Drücken Sie , um Ihre Aktion zu bestätigen
es: Pulse para confirmar su acción
fr: Appuyez pour confirmer votre action

# cancelContext
source: Press to cancel your action
de: Drücken Sie , um Ihre Aktion abzubrechen
es: Pulse para cancelar su acción
fr: Appuyez pour annuler votre action

# formerPassword
source: Write your former password
de: Geben Sie Ihr altes Passwort ein
es: Escriba su anterior contraseña
fr: Écrivez vous votre ancient mot de passe

# newPassword
source: Write the new password
de: Geben Sie das neue Passwort ein
es: Escriba la nueva contraseña
fr: Écrivez vous le neu mot de passe

# repeatNewPass
source: Repeat the new password
de: Wiederholen Sie das neue Passwort
es: Repita la nueva contraseña
fr: Répetez vous le neu mot de passe

# errorSamePass
source: The new password can't be like the old one
de: Das neue Passwort darf nicht mit dem vorherigen identisch sein
es: La nueva contraseña no puede ser como la anterior
fr: Le neu mot de passe ne peut pas être comme l'ancient

# newUserName
source: Write your new username
de: Geben Sie Ihren neuen Benutzernamen ein
es: Escriba su nuevo nombre de usuario
fr: Écrivez vous le neu nom d'utilisateur

# passConfirm
source: Confirm by writing your password
de: Bestätigen Sie, indem Sie Ihr Passwort eingeben
es: Confirme escribiendo su contraseña
fr: Confirmer en tapant votre mot de passe

# linkput
source: Paste here your image link
de: Fügen Sie den Link zu Ihrem Bild ein
es: Pegue el enlace a su imagen
fr: Collez le lien vers votre image.

# loadImg
source: Load Image
de: Bild hochladen
es: Cargar imagen
fr: Télécharger l'image

# sizePassed
source: Character limit exceeded
de: Zeichenbeschränkung überschritten
es: Se excedió el límite de caracteres
fr: Limite de caractères dépassée

# appVer
source: App Version
es: Versión de la Aplicación
fr: Version de l'application

# appFixesContent
source: Added Language Support
de: Verschiedene Sprachen hinzugefügt
es: Idiomas añadidos
fr: Ajout de différentes langues

# appLastFix
source: Version Alpha 0.1 - Flutter
de: Alpha-Version 0.1 - Flutter
es: Versión Alpha 0.1 - Flutter

source: Email
es: Correo Electrónico
